/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1

Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6

Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет
*/

int midNumberGetter(int number)
{
    return ((number - 100*(number / 100)) / 10 );
}

Console.WriteLine("Введите трёхзначеное число:");
int num = int.Parse(Console.ReadLine());
if(num < 100 || num > 999) Console.WriteLine("Невероное значение");
int mid = midNumberGetter(num);
Console.WriteLine($"Ваше среднее число = {mid}");